In [1]:
import pandas as pd 
import numpy as np

In [2]:
df = pd.read_csv('titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
df.drop(['PassengerId','Name','Parch','Ticket','Cabin','Embarked','SibSp'], axis='columns', inplace=True)
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [5]:
target = df.Survived
input = df.drop(['Survived'], axis='columns')

In [7]:
dummies = pd.get_dummies(input.Sex).astype('int')
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [11]:
input = pd.concat([input, dummies], axis='columns')

In [12]:
input.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [14]:
input = input.drop(['Sex'], axis='columns')
input.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [17]:
#check if there are Nan values or null values
input.columns[input.isna().any()]

Index(['Age'], dtype='object')

In [52]:
input['Age'] = pd.to_numeric(input['Age'], errors='coerce')

In [54]:
input.Age = input.Age.fillna(input.Age.mean())
input.head(6)

   Pclass        Age     Fare  female  male
0       3  22.000000   7.2500       0     1
1       1  38.000000  71.2833       1     0
2       3  26.000000   7.9250       1     0
3       1  35.000000  53.1000       1     0
4       3  35.000000   8.0500       0     1
5       3  29.699118   8.4583       0     1

In [60]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(input, target, test_size=0.3)

In [61]:
#Gaussian naive base
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [62]:
model.fit(X_train, y_train)

GaussianNB()

In [63]:
model.score(X_test, y_test)

0.8022388059701493

In [64]:
X_test[:10]

     Pclass        Age      Fare  female  male
99        2  34.000000   26.0000       0     1
676       3  24.500000    8.0500       0     1
753       3  23.000000    7.8958       0     1
348       3   3.000000   15.9000       0     1
373       1  22.000000  135.6333       0     1
763       1  36.000000  120.0000       1     0
52        1  49.000000   76.7292       1     0
194       1  44.000000   27.7208       1     0
334       1  29.699118  133.6500       1     0
130       3  33.000000    7.8958       0     1

In [65]:
y_test[:10]

99     0
676    0
753    0
348    1
373    0
763    1
52     1
194    1
334    1
130    0
Name: Survived, dtype: int64

In [67]:
model.predict(X_test[:10])

array([0, 0, 0, 0, 1, 1, 1, 1, 1, 0], dtype=int64)

In [69]:
model.predict_proba(X_test[:10])

array([[9.74181386e-01, 2.58186137e-02],
       [9.88288635e-01, 1.17113648e-02],
       [9.88085040e-01, 1.19149603e-02],
       [9.82141754e-01, 1.78582463e-02],
       [5.34061126e-02, 9.46593887e-01],
       [2.99789222e-04, 9.99700211e-01],
       [3.31127721e-03, 9.96688723e-01],
       [1.23943234e-02, 9.87605677e-01],
       [1.03581986e-04, 9.99896418e-01],
       [9.88927960e-01, 1.10720405e-02]])